Repository: IDIRYACINE/ProgressWebtu
Catalog: lib/localization/locale_*.arb
Languages: ar, fr

# groupAndSection
source: Group and Sections
ar: المجموعة والأقسام
fr: Groupe et Sections

source: Exams Planning
ar: خطة الامتحانات
fr: Planning des examens

source: Exams Results
ar: نتائج الامتحانات
fr: Résultats des examens

source: Evaluations
ar: التقييمات
fr: Évaluations

source: Scholar Debt
ar: دين دراسي
fr: Dette scolaire

source: Subscriptions
ar: الاشتراكات
fr: Abonnements

source: Home
ar: الصفحة الرئيسية
fr: Accueil

source: Profile
ar: الملف الشخصي
fr: Profil

source: Logout
ar: تسجيل الخروج
fr: Déconnexion

source: Login
ar: تسجيل الدخول
fr: Connexion

# academicVacation
source: Academic Vacations
ar: العطل الدراسية
fr: Vacances académiques

# bacInfo
source: BAC Information
ar: معلومات الباكالوريا
fr: Informations BAC

# notesRegister
source: Notes Record
ar: سجل الدرجات
fr: Releve de notes

source: First and Last Name
ar: الاسم الأول والأخير
fr: Nom et Prénom

source: Change Password
ar: تغيير كلمة المرور
fr: Changer le mot de passe

source: Birth Place
ar: مكان الميلاد
fr: Lieu de naissance

source: Birth Date
ar: تاريخ الميلاد
fr: Date de naissance

source: Change Language
ar: تغيير اللغة
fr: Changer la langue

source: Change Theme
ar: تغيير الواجهة
fr: Changer le thème

source: Confirm
ar: تاكيد
fr: Confirmer

source: Cancel
ar: الغاء
fr: Annuler

source: Payement
ar: الدفع
fr: Paiement

source: Settings
ar: الاعدادات
fr: Paramètres

source: Arabic
ar: عربي
fr: Arabe

source: French
ar: فرنسي
fr: Français

source: English
ar: انجليزي
fr: Anglais

source: Dark Theme
ar: الواجهة السوداء
fr: Thème sombre

source: Light Theme
ar: الواجهة البيضاء
fr: Thème clair

source: Theme
ar: الواجهة
fr: Thème

source: Language
ar: اللغة
fr: Langue

source: Username
ar: اسم المستخدم
fr: Nom d'utilisateur

source: Password
ar: كلمة المرور
fr: Mot de passe

# passwordTooShort
source: Password is too short
ar: كلمة المرور قصيرة جدا
fr: Mot de passe trop court

# usernameRequired
source: Username is required
ar: اسم المستخدم مطلوب
fr: Nom d'utilisateur obligatoire

# passwordRequired
source: Password is required
ar: كلمة المرور مطلوبة
fr: Mot de passe obligatoire

source: Wrong username or password
ar: اسم المستخدم أو كلمة المرور خاطئة
fr: Nom d'utilisateur ou mot de passe incorrect

source: Login failed
ar: فشل تسجيل الدخول
fr: Échec de la connexion

# usernameInvalid
source: Invalid username
ar: اسم المستخدم غير صحيح
fr: Nom d'utilisateur invalide

source: Unavailable
ar: غير متوفر
fr: Indisponible

source: Could not load data
ar: لا يمكن تحميل البيانات
fr: Impossible de charger les données

source: Loading
ar: جاري التحميل
fr: Chargement

# dossierEtudiantId
source: Student File ID
ar: ملف الطالب الشخصي
fr: dossierEtudiantId

# note
source: grade
ar: درجة
fr: note

# refCodeMatiere
source: Subject Code Reference
ar: رمز المادة المرجعي
fr: refCodeMatiere

# individuDateNaissance
source: Individual Date of Birth
ar: تاريخ الميلاد الشخصي
fr: individuDateNaissance

# individuId
source: Individual ID
ar: هوية الشخص
fr: individuId

# individuLieuNaissance
source: Individual Place of Birth
ar: مكان الميلاد الشخصي
fr: individuLieuNaissance

# individuLieuNaissanceArabe
source: Individual Place of Birth (Arabic)
ar: مكان الميلاد الشخصي (العربية)
fr: individuLieuNaissanceArabe

# individuNomArabe
source: Individual Arabic Name
ar: الإسم العربي الشخصي
fr: individuNomArabe

# individuNomLatin
source: Individual Latin Name
ar: الإسم اللاتيني الشخصي
fr: individuNomLatin

# individuPrenomArabe
source: Individual Arabic First Name
ar: الإسم الشخصي الأول باللغة العربية
fr: individuPrenomArabe

# individuPrenomLatin
source: Individual Latin First Name
ar: الإسم الشخصي الأول باللغة اللاتينية
fr: individuPrenomLatin

# lastMoyenne
source: Last Average
ar: آخر معدل
fr: lastMoyenne

# llEtablissementArabe
source: Establishment Name (Arabic)
ar: اسم المؤسسة (العربية)
fr: llEtablissementArabe

# llEtablissementLatin
source: Establishment Name (Latin)
ar: اسم المؤسسة (اللاتينية)
fr: llEtablissementLatin

# niveauLibelleLongAr
source: Level Long Label (Arabic)
ar: عنوان المستوى الطويل (العربية)
fr: niveauLibelleLongAr

# niveauRang
source: Level Rank
ar: رتبة المستوى
fr: niveauRang

# numeroInscription
source: Registration Number
ar: رقم التسجيل
fr: numeroInscription

# numeroMatricule
source: Registration Number
ar: رقم التسجيل
fr: numeroMatricule

# ofCodeDomaine
source: Field Code
ar: رمز المجال
fr: ofCodeDomaine

# ofCodeFiliere
source: Major Code
ar: رمز التخصص الرئيسي
fr: ofCodeFiliere

# ofCodeSpecialite
source: Specialization Code
ar: رمز التخصص
fr: ofCodeSpecialite

# ofIdDomaine
source: Field ID
ar: هوية المجال
fr: ofIdDomaine

# ofIdFiliere
source: Major ID
ar: هوية التخصص الرئيسي
fr: ofIdFiliere

# ofIdSpecialite
source: Specialization ID
ar: هوية التخصص
fr: ofIdSpecialite

# ofLlDomaine
source: Field Name
ar: اسم المجال
fr: ofLlDomaine

# ofLlDomaineArabe
source: Field Name (Arabic)
ar: اسم المجال (العربية)
fr: ofLlDomaineArabe

# ofLlFiliere
source: Major Name
ar: اسم التخصص الرئيسي
fr: ofLlFiliere

# absenceJustifie
source: justified absence
ar: غياب مبرر
fr: absenceJustifie

source: absent
ar: غائب

# conge
source: leave
ar: إجازة
fr: conge

# copieNonRemise
source: copy not handed in
ar: نسخة غير مسلمة
fr: copieNonRemise

# etudiantRachete
source: student repurchased
ar: طالب مشتري
fr: etudiantRachete

# exclu
source: excluded
ar: مطروح
fr: exclu

source: id
ar: الهوية

# idPeriode
source: period id
ar: هوية الفترة
fr: idPeriode

source: modifiable by jury
ar: قابل للتعديل بواسطة الجري

# moyenneGenerale
source: overall average
ar: المعدل العام
fr: moyenneGenerale

# noteEliminatoire
source: eliminatory note
ar: درجة الإخلاء
fr: noteEliminatoire

# noteObtenu
source: obtained note
ar: درجة الحصول
fr: noteObtenu

# oldAbsenceJustifie
source: old justified absence
ar: الغياب المبرر القديم
fr: oldAbsenceJustifie

source: old absent
ar: الغائب القديم

# oldCopieNonRemise
source: old copy not handed in
ar: النسخة القديمة التي لم تسلم
fr: oldCopieNonRemise

source: planning session id
ar: هوية جلسة الخطة

# planningSessionIntitule
source: planning session title
ar: عنوان جلسة الخطة
fr: planningSessionIntitule

# rattachementMcCoefficient
source: attachment mc coefficient
ar: ضمان معامل الجدول الدراسي
fr: rattachementMcCoefficient

# rattachementMcCredit
source: attachment mc credit
ar: ضمان الائتمان الجدول الدراسي
fr: rattachementMcCredit

# rattachementMcId
source: attachment mc id
ar: ضمان هوية الجدول الدراسي
fr: rattachementMcId

source: reader by jury
ar: قارئ بواسطة الجري

source: subscribed
ar: مشترك

source: total coefficient
ar: مجموع المعامل

source: ue code
ar: رمز الوحدة التعليمية

source: ue nature ll fr
ar: طبيعة الوحدة التعليمية

# anneeAcademiqueCode
source: academic year code
ar: رمز العام الدراسي
fr: anneeAcademiqueCode

# anneeAcademiqueId
source: academic year id
ar: هوية العام الدراسي
fr: anneeAcademiqueId

# avecControle
source: with control
ar: مع التحكم
fr: avecControle

# avecControleContinu
source: with continuous control
ar: مع التحكم المستمر
fr: avecControleContinu

# avecControleIntermediaire
source: with intermediate control
ar: مع التحكم الوسطي
fr: avecControleIntermediaire

# ofLlFiliereArabe
source: Major Name (Arabic)
ar: اسم التخصص (العربية)
fr: ofLlFiliereArabe

# ofLlSpecialite
source: Specialization Name
ar: اسم التخصص
fr: ofLlSpecialite

# ofLlSpecialiteArabe
source: Specialization Name (Arabic)
ar: اسم التخصص (العربية)
fr: ofLlSpecialiteArabe

source: photo
ar: صورة

# refCodeCycle
source: Cycle Code Reference
ar: رمز الدورة المرجعي
fr: refCodeCycle

# refLibelleCycle
source: Cycle Label Reference
ar: عنوان الدورة المرجعي
fr: refLibelleCycle

# refLibelleCycleAr
source: Cycle Label Reference (Arabic)
ar: عنوان الدورة المرجعي (العربية)
fr: refLibelleCycleAr

# anneeBac
source: Year of High School Diploma
ar: سنة الشهادة الثانوية
fr: anneeBac

# dateNaissance
source: Date of Birth
ar: تاريخ الميلاد
fr: dateNaissance

# libelleSerieBac
source: High School Diploma Series Label
ar: عنوان مجموعة الشهادة الثانوية
fr: libelleSerieBac

# matricule
source: Registration Number
ar: رقم التسجيل
fr: matricule

# moyenneBac
source: High School Diploma Average
ar: معدل الشهادة الثانوية
fr: moyenneBac

# moyenneGeneraleBac
source: Overall High School Diploma Average
ar: المعدل العام للشهادة الثانوية
fr: moyenneGeneraleBac

# nin
source: National Identification Number
ar: رقم الهوية الوطنية
fr: nin

# nomAr
source: Name (Arabic)
ar: الاسم (العربية)
fr: nomAr

# nomFr
source: Name (French)
ar: الاسم (الفرنسية)
fr: nomFr

# prenomAr
source: First Name (Arabic)
ar: الاسم الأول (العربية)
fr: prenomAr

# prenomFr
source: First Name (French)
ar: الاسم الأول (الفرنسية)
fr: prenomFr

# refCodeSerieBac
source: High School Diploma Series Code Reference
ar: رمز مجموعة الشهادة الثانوية المرجعي
fr: refCodeSerieBac

# refCodeWilayaBac
source: High School Diploma Region Code Reference
ar: رمز منطقة الشهادة الثانوية المرجعي
fr: refCodeWilayaBac

# deuxiemeAnnee
source: Second Year
ar: السنة الثانية
fr: deuxiemeAnnee

# libelle
source: Label
ar: العنوان
fr: libelle

# premiereAnnee
source: First Year
ar: السنة الأولى
fr: premiereAnnee

# semaineDebut
source: Week Start
ar: بداية الأسبوع
fr: semaineDebut

# semaineFin
source: Week End
ar: نهاية الأسبوع
fr: semaineFin

source: valid
ar: صحيح

# codePeriode
source: period code
ar: كود الفترة
fr: codePeriode

source: coefficient
ar: معامل

# coefficientNoteEliminatoire
source: coefficient eliminatory note
ar: معامل الدرجة المحذوفة
fr: coefficientNoteEliminatoire

source: cycle code
ar: كود الدورة

source: cycle id
ar: معرف الدورة

# dateCloture
source: closing date
ar: تاريخ الإغلاق
fr: dateCloture

# dateCreation
source: creation date
ar: تاريخ الإنشاء
fr: dateCreation

# dateDebut
source: start date
ar: تاريخ البدء
fr: dateDebut

# dateFin
source: end date
ar: تاريخ الانتهاء
fr: dateFin

# datePublication
source: publication date
ar: تاريخ النشر
fr: datePublication

# estMigree
source: is migree
ar: هل هو مغر
fr: estMigree

# examenSessionDtos
source: exam session dtos
ar: دورات الامتحان
fr: examenSessionDtos

# intitule
source: Title
ar: العنوان
fr: intitule

# libellePeriode
source: Period Label
ar: علامة الفترة
fr: libellePeriode

# niveauCode
source: Level Code
ar: رمز المستوى
fr: niveauCode

# niveauId
source: Level Id
ar: معرف المستوى
fr: niveauId

# niveauLibelleLongLt
source: Long Level Label Lt
ar: علامة المستوى الطويلة Lt
fr: niveauLibelleLongLt

# nombreNote
source: Number of Grades
ar: عدد الدرجات
fr: nombreNote

# notesValide
source: Valid Grades
ar: درجات صالحة
fr: notesValide

# numeroSession
source: Session Number
ar: رقم الجلسة
fr: numeroSession

# offreFormationCode
source: Training Offer Code
ar: رمز العرض التدريبي
fr: offreFormationCode

# offreFormationId
source: Training Offer Id
ar: معرف العرض التدريبي
fr: offreFormationId

# offreFormationLibelleAr
source: Training Offer Label Ar
ar: علامة العرض التدريبي Ar
fr: offreFormationLibelleAr

# offreFormationLibelleFr
source: Training Offer Label Fr
ar: علامة العرض التدريبي Fr
fr: offreFormationLibelleFr

# ouvertureOffreFormationId
source: Opening Training Offer Id
ar: افتتاح معرف العرض التدريبي
fr: ouvertureOffreFormationId

# refCodeEtablissement
source: Establishment Code Reference
ar: إشارة الكود المؤسسة
fr: refCodeEtablissement

# sessionARemplacerId
source: Session to Replace Id
ar: جلسة للاستبدال معرف
fr: sessionARemplacerId

# sessionARemplacerIntitule
source: Session to Replace Title
ar: جلسة للاستبدال العنوان
fr: sessionARemplacerIntitule

source: Situation Code
ar: رمز الوضع

source: Situation Id
ar: معرف الوضع

# situationLibelleAr
source: Situation Label Ar
ar: علامة الوضع Ar
fr: situationLibelleAr

# situationLibelleFr
source: Situation Label Fr
ar: علامة الوضع Fr
fr: situationLibelleFr

# etablissementId
source: Establishment Id
ar: معرف المؤسسة
fr: etablissementId

# dateAffectation
source: Assignment Date
ar: تاريخ التعيين
fr: dateAffectation

# groupePedagogiqueId
source: Pedagogical Group Id
ar: معرف المجموعة التعليمية
fr: groupePedagogiqueId

# nomGroupePedagogique
source: Pedagogical Group Name
ar: اسم المجموعة التعليمية
fr: nomGroupePedagogique

# nomSection
source: Section Name
ar: اسم القسم
fr: nomSection

# periodeCode
source: Period Code
ar: رمز الفترة
fr: periodeCode

# periodeId
source: Period Id
ar: معرف الفترة
fr: periodeId

# periodeLibelleLongLt
source: Long Period Label Lt
ar: علامة الفترة الطويلة Lt
fr: periodeLibelleLongLt

source: Credit
ar: ائتمان

# libelleCourtAr
source: Short Label Ar
ar: العلامة القصيرة العربية
fr: libelleCourtAr

# libelleCourtLt
source: Short Label Lt
ar: العلامة القصيرة لت
fr: libelleCourtLt

# libelleLongAr
source: Long Label Ar
ar: العلامة الطويلة العربية
fr: libelleLongAr

# libelleLongFrCycle
source: Long Label Fr Cycle
ar: العلامة الطويلة Fr الدورة
fr: libelleLongFrCycle

# libelleLongFrNiveau
source: Long Label Fr Level
ar: العلامة الطويلة Fr المستوى
fr: libelleLongFrNiveau

# libelleLongLt
source: Long Label Lt
ar: العلامة الطويلة لت
fr: libelleLongLt

# ncPeriodeCode
source: ncPeriod Code
ar: كود الفترة الغير المعتمد
fr: ncPeriodeCode

# ncPeriodeId
source: ncPeriod Id
ar: معرف الفترة الغير المعتمد
fr: ncPeriodeId

# ncPeriodeLibelle
source: ncPeriod Label
ar: علامة الفترة الغير المعتمد
fr: ncPeriodeLibelle

# rang
source: Rank
ar: رتبة
fr: rang

# rangNiveau
source: Level Rank
ar: رتبة المستوى
fr: rangNiveau

# refCodePeriode
source: Period Code Reference
ar: مرجع كود الفترة
fr: refCodePeriode

# refCodePeriodicite
source: Periodicity Code Reference
ar: مرجع كود التدويرية
fr: refCodePeriodicite
